----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 200, 200]             320
       BatchNorm2d-2         [-1, 32, 200, 200]              64
              ReLU-3         [-1, 32, 200, 200]               0
         MaxPool2d-4         [-1, 32, 100, 100]               0
            Conv2d-5         [-1, 64, 100, 100]          18,496
       BatchNorm2d-6         [-1, 64, 100, 100]             128
              ReLU-7         [-1, 64, 100, 100]               0
         MaxPool2d-8           [-1, 64, 50, 50]               0
            Conv2d-9          [-1, 128, 50, 50]          73,856
      BatchNorm2d-10          [-1, 128, 50, 50]             256
             ReLU-11          [-1, 128, 50, 50]               0
        MaxPool2d-12          [-1, 128, 25, 25]               0
           Conv2d-13          [-1, 128, 25, 25]         147,584
      BatchNorm2d-14          [-1, 128, 25, 25]             256
             ReLU-15          [-1, 128, 25, 25]               0
        MaxPool2d-16          [-1, 128, 12, 12]               0
           Conv2d-17          [-1, 256, 12, 12]         295,168
      BatchNorm2d-18          [-1, 256, 12, 12]             512
             ReLU-19          [-1, 256, 12, 12]               0
           Conv2d-20          [-1, 256, 12, 12]         590,080
      BatchNorm2d-21          [-1, 256, 12, 12]             512
             ReLU-22          [-1, 256, 12, 12]               0
           Conv2d-23           [-1, 16, 12, 12]          36,880
      BatchNorm2d-24           [-1, 16, 12, 12]              32
             ReLU-25           [-1, 16, 12, 12]               0
 FeatureExtractor-26           [-1, 16, 12, 12]               0
           Linear-27                  [-1, 240]         553,200
             ReLU-28                  [-1, 240]               0
           Linear-29                    [-1, 7]           1,687
          Sigmoid-30                    [-1, 7]               0
   LocalizingHead-31                    [-1, 7]               0
================================================================
Total params: 1,719,031
Trainable params: 1,719,031
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.15
Forward/backward pass size (MB): 59.28
Params size (MB): 6.56
Estimated Total Size (MB): 65.99
----------------------------------------------------------------